In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    'name': ['rafael', 'gabriel', 'rafael', 'michael'],
    'mark': [10, 9, 8, 7],
})

In [8]:
df

      name  mark
0   rafael    10
1  gabriel     9
2   rafael     8
3  michael     7

In [9]:
df.mark

0    10
1     9
2     8
3     7
Name: mark, dtype: int64

In [10]:
df.mark[2]

8

In [11]:
df['mark']

0    10
1     9
2     8
3     7
Name: mark, dtype: int64

In [15]:
df.loc[2, 'mark']

8

In [18]:
df.iloc[2, 1]

8

In [19]:
df.T

           0        1       2        3
name  rafael  gabriel  rafael  michael
mark      10        9       8        7

In [21]:
df.T.loc['mark']

0    10
1     9
2     8
3     7
Name: mark, dtype: object

In [24]:
df.groupby('name').mean()

         mark
name
gabriel   9.0
michael   7.0
rafael    9.0

In [25]:
df.groupby('name').count()

         mark
name
gabriel     1
michael     1
rafael      2

In [26]:
df.mark[df.name=='rafael']

0    10
2     8
Name: mark, dtype: int64

In [27]:
df.mark[df.name=='rafael'].mean()

9.0

In [28]:
df.mark[df.name=='rafael'].max()

10